matoliva/onda-firmware/sdkconfig.defaults
# Onda hardware baseline: Waveshare ESP32-S3-ePaper-1.54G (ESP32-S3-PICO-1-N8R8)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Phase 006 Wi-Fi BLE provisioning baseline. Flash/NVS encryption is isolated
# in sdkconfig.secure.defaults so daily development flashing never burns eFuses.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Phase 008 SD-card baseline stores its Onda-owned diagnostic file as
# /sdcard/onda-test.txt, which requires FAT long filename support.
CONFIG_FATFS_LFN_STACK=y
